Revit 2027 API
RebarBendingDetailType.AngularDimensionsForHooksEnabled Property
 Identifies if the angular dimensions which has a reference set on a hook will be shown or not.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AngularDimensionsForHooksEnabled { get; set; }
Public Property AngularDimensionsForHooksEnabled As Boolean
	Get
	Set
public:
property bool AngularDimensionsForHooksEnabled {
	bool get ();
	void set (bool value);
}
member AngularDimensionsForHooksEnabled : bool with get, set
Property Value
Boolean
See Also
Reference
RebarBendingDetailType Class
Autodesk.Revit.DB.Structure Namespace